# Pandas Methods(Practice)

In [1]:
import numpy as np
import pandas as pd

In [5]:
ser = pd.Series([1,2,3,4,4])
ser

0    1
1    2
2    3
3    4
4    4
dtype: int64

In [9]:
my_data = [5,4,8,9,1]
labels = ['a','b','c','d','e']

In [10]:
pd.Series(my_data,labels)

a    5
b    4
c    8
d    9
e    1
dtype: int64

In [24]:
ser22 = pd.Series(np.arange(10))

In [26]:
ser22

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [29]:
ser22[9]

9

In [35]:
con1 = pd.Series([9,5,6,7],['India','Aust','Jap','America'])

In [32]:
con2 = pd.Series([4,5,6,7],['India','Aust','Jap','Bangla'])

In [37]:
con1 + con2

America     NaN
Aust       10.0
Bangla      NaN
India      13.0
Jap        12.0
dtype: float64

In [38]:
from numpy.random import randn

In [39]:
np.random.seed(101)

In [41]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],["W",'X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [44]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [45]:
type(df['W'])

pandas.core.series.Series

In [47]:
type(df)

pandas.core.frame.DataFrame

In [48]:
df[['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127

In [49]:
df['new'] = df['W'] +df['Y']

In [50]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [52]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [53]:
#Still have the new column in dataframe
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [59]:
#to actually delete the row in df
#use inplace
df.drop('Z',axis=1,inplace=True)
df

          W         X         Y
A  0.302665  1.693723 -1.706086
B -0.134841  0.390528  0.166905
C  0.807706  0.072960  0.638787
D -0.497104 -0.754070 -0.943406
E -0.116773  1.901755  0.238127

In [60]:
df

          W         X         Y
A  0.302665  1.693723 -1.706086
B -0.134841  0.390528  0.166905
C  0.807706  0.072960  0.638787
D -0.497104 -0.754070 -0.943406
E -0.116773  1.901755  0.238127

# axis =0 is for rows and axis=1 is for columns

In [61]:
df.shape

(5, 3)

In [68]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Name: A, dtype: float64

In [70]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Name: A, dtype: float64

In [73]:
df.loc['A','W']

0.3026654485851825

In [77]:
df.loc[['A','C'],['W']]

          W
A  0.302665
C  0.807706

In [80]:
df>0

       W      X      Y
A   True   True  False
B  False   True   True
C   True   True   True
D  False  False  False
E  False   True   True

In [81]:
df[df>0]

          W         X         Y
A  0.302665  1.693723       NaN
B       NaN  0.390528  0.166905
C  0.807706  0.072960  0.638787
D       NaN       NaN       NaN
E       NaN  1.901755  0.238127

In [82]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [83]:
df[df['W']>0]

          W         X         Y
A  0.302665  1.693723 -1.706086
C  0.807706  0.072960  0.638787

In [87]:
result = df[df['Y']<0]
result

          W         X         Y
A  0.302665  1.693723 -1.706086
D -0.497104 -0.754070 -0.943406

In [92]:
result['W']

A    0.302665
D   -0.497104
Name: W, dtype: float64

In [93]:
result.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Name: A, dtype: float64

In [96]:
df[df['X']<0]['X']

D   -0.75407
Name: X, dtype: float64

In [101]:
df[(df['W']>1) | (df['X']>1)]

          W         X         Y
A  0.302665  1.693723 -1.706086
E -0.116773  1.901755  0.238127

In [102]:
df[(df['X']<0)& (df['W']<0)]

          W        X         Y
D -0.497104 -0.75407 -0.943406

In [104]:
df.reset_index()

  index         W         X         Y
0     A  0.302665  1.693723 -1.706086
1     B -0.134841  0.390528  0.166905
2     C  0.807706  0.072960  0.638787
3     D -0.497104 -0.754070 -0.943406
4     E -0.116773  1.901755  0.238127

In [105]:
newind = 'AK BK CK DK EK'.split()

In [107]:
df['STATES'] = newind

In [108]:
df

          W         X         Y STATES
A  0.302665  1.693723 -1.706086     AK
B -0.134841  0.390528  0.166905     BK
C  0.807706  0.072960  0.638787     CK
D -0.497104 -0.754070 -0.943406     DK
E -0.116773  1.901755  0.238127     EK

In [110]:
df.set_index('STATES')

               W         X         Y
STATES
AK      0.302665  1.693723 -1.706086
BK     -0.134841  0.390528  0.166905
CK      0.807706  0.072960  0.638787
DK     -0.497104 -0.754070 -0.943406
EK     -0.116773  1.901755  0.238127

In [112]:
df.reset_index()

  index         W         X         Y STATES
0     A  0.302665  1.693723 -1.706086     AK
1     B -0.134841  0.390528  0.166905     BK
2     C  0.807706  0.072960  0.638787     CK
3     D -0.497104 -0.754070 -0.943406     DK
4     E -0.116773  1.901755  0.238127     EK

In [121]:
df.reset_index(inplace=True)

   level_0 index         W         X         Y STATES
0        0     A  0.302665  1.693723 -1.706086     AK
1        1     B -0.134841  0.390528  0.166905     BK
2        2     C  0.807706  0.072960  0.638787     CK
3        3     D -0.497104 -0.754070 -0.943406     DK
4        4     E -0.116773  1.901755  0.238127     EK

In [122]:
df.set_index('STATES')

        level_0 index         W         X         Y
STATES
AK            0     A  0.302665  1.693723 -1.706086
BK            1     B -0.134841  0.390528  0.166905
CK            2     C  0.807706  0.072960  0.638787
DK            3     D -0.497104 -0.754070 -0.943406
EK            4     E -0.116773  1.901755  0.238127

In [124]:
df

   level_0 index         W         X         Y STATES
0        0     A  0.302665  1.693723 -1.706086     AK
1        1     B -0.134841  0.390528  0.166905     BK
2        2     C  0.807706  0.072960  0.638787     CK
3        3     D -0.497104 -0.754070 -0.943406     DK
4        4     E -0.116773  1.901755  0.238127     EK

# Multiindexing

In [24]:
outside =['g1','g2','g2','g1']
inside =[1,2,2,1]

In [25]:
import pandas as pd
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [26]:
hier_index

MultiIndex(levels=[['g1', 'g2'], [1, 2]],
           codes=[[0, 1, 1, 0], [0, 1, 1, 0]])

In [27]:
from numpy.random import randn
df1 = pd.DataFrame(randn(4,2),hier_index,['A','B'])
df1

             A         B
g1 1  1.013811 -0.432630
g2 2  1.562951  1.515732
   2  0.158391  0.458224
g1 1 -1.909525  1.093234

In [42]:
df1.loc['g2'] ##Both index 2 belongs to g2

          A         B
2  1.562951  1.515732
2  0.158391  0.458224

In [43]:
df1['A'] #Both index 2 belongs to g2

g1  1    1.013811
g2  2    1.562951
    2    0.158391
g1  1   -1.909525
Name: A, dtype: float64

In [36]:
df1['A'].loc['g2']

2    1.562951
2    0.158391
Name: A, dtype: float64

In [39]:
df1.loc['g2'].loc[2,'B']

2    1.515732
2    0.458224
Name: B, dtype: float64

In [44]:
df1

             A         B
g1 1  1.013811 -0.432630
g2 2  1.562951  1.515732
   2  0.158391  0.458224
g1 1 -1.909525  1.093234

In [46]:
df1.index.names = ['groups','num']

# df1

# Cross section using xs

# to retrieve num 1 from both groups:

In [51]:
df1.xs(1,level='num')

               A         B
groups
g1      1.013811 -0.432630
g1     -1.909525  1.093234

In [54]:
df1.xs('g1')

            A         B
num
1    1.013811 -0.432630
1   -1.909525  1.093234

In [57]:
df1.xs('g1',level='groups')

            A         B
num
1    1.013811 -0.432630
1   -1.909525  1.093234

In [67]:
import numpy as np
dic = {'a':[1,2,np.nan],'b':[5,6,8],'c':[6,np.nan,7]}

In [110]:
dfnan = pd.DataFrame(dic)

In [111]:
dfnan

     a  b    c
0  1.0  5  6.0
1  2.0  6  NaN
2  NaN  8  7.0

In [69]:
dfnan.dropna(axis=1)

   b
0  5
1  6
2  8

In [72]:
dfnan.dropna()

     a  b    c
0  1.0  5  6.0

In [86]:
dfnan.dropna(thresh=0)

     a  b    c
0  1.0  5  6.0
1  2.0  6  NaN
2  NaN  8  7.0

In [88]:
df2= dfnan.copy()

In [89]:
df2

     a  b    c
0  1.0  5  6.0
1  2.0  6  NaN
2  NaN  8  7.0

In [91]:
df2.loc[1,'a'] =np.nan

In [92]:
df2

     a  b    c
0  1.0  5  6.0
1  NaN  6  NaN
2  NaN  8  7.0

# Note the diffrence when thresh is 1, no record with even 1 nan is deleted, where as for thresh as 2 recodes with 2 
are getting deleted.

In [93]:
df2.dropna(thresh=2)

     a  b    c
0  1.0  5  6.0
2  NaN  8  7.0

In [94]:
df2.dropna(thresh=1)

     a  b    c
0  1.0  5  6.0
1  NaN  6  NaN
2  NaN  8  7.0

In [96]:
df2.loc[1,'b'] =np.nan

In [97]:
df2

     a    b    c
0  1.0  5.0  6.0
1  NaN  NaN  NaN
2  NaN  8.0  7.0

In [98]:
df2.dropna(thresh=2) # so record with minimum 2 nan are getting deleted

     a    b    c
0  1.0  5.0  6.0
2  NaN  8.0  7.0

In [105]:
df2.fillna(value=0)

     a    b    c
0  1.0  5.0  6.0
1  0.0  0.0  0.0
2  0.0  8.0  7.0

In [106]:
df2

     a    b    c
0  1.0  5.0  6.0
1  NaN  NaN  NaN
2  NaN  8.0  7.0

In [108]:
df2['a'].fillna(value=df2['a'].mean())

0    1.0
1    1.0
2    1.0
Name: a, dtype: float64